src/main/resources/xmls/salesforcequery/CreateReqOpportunityRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
	<Header>
		<SessionHeader xmlns="urn:partner.soap.sforce.com">
			<sessionId></sessionId>
		</SessionHeader>
	</Header>
	<Body>
		<create xmlns="urn:partner.soap.sforce.com">
			<sObjects>
				<type xmlns="urn:sobject.partner.soap.sforce.com">Opportunity</type>
				<Name xmlns="">test</Name>
				<CloseDate xmlns=""></CloseDate>
				<StageName xmlns=""></StageName>
				<Req_Product__c xmlns=""></Req_Product__c>
				<Req_Total_Positions__c xmlns=""></Req_Total_Positions__c>
				<Req_Job_Title__c xmlns=""></Req_Job_Title__c>
				<Req_Terms_of_engagement__c xmlns=""></Req_Terms_of_engagement__c>
				<Req_Worksite_City__c xmlns=""></Req_Worksite_City__c>
				<Req_Worksite_Country__c xmlns=""></Req_Worksite_Country__c>
				<Req_Worksite_Street__c xmlns=""></Req_Worksite_Street__c>
				<Req_Worksite_Postal_Code__c xmlns=""></Req_Worksite_Postal_Code__c>
				<Req_Worksite_State__c xmlns=""></Req_Worksite_State__c>
				<Req_Hiring_Manager__c xmlns=""></Req_Hiring_Manager__c>
				<Req_Division__c xmlns=""></Req_Division__c>
				<Currency__c xmlns=""></Currency__c>
				<AccountId xmlns=""></AccountId>
				<OpCo__c xmlns=""></OpCo__c>
				<RecordTypeId xmlns=""></RecordTypeId>
				<Legacy_Product__c xmlns=""></Legacy_Product__c>
				<Organization_Office__c xmlns=""></Organization_Office__c>
				<Req_Rate_Frequency__c xmlns=""></Req_Rate_Frequency__c>
				<Req_Job_Description__c xmlns=""></Req_Job_Description__c>
				<Req_Qualification__c xmlns=""></Req_Qualification__c>
				<EnterpriseReqSkills__c xmlns=""></EnterpriseReqSkills__c>
				<Req_EVP__c xmlns=""></Req_EVP__c>
				<Req_Business_Challenge__c xmlns=""></Req_Business_Challenge__c>
				<Req_Competition_Info__c xmlns=""></Req_Competition_Info__c>
				<Req_Bill_Rate_Min__c xmlns=""></Req_Bill_Rate_Min__c>
				<Req_Bill_Rate_Max__c xmlns=""></Req_Bill_Rate_Max__c>
				<Req_Pay_Rate_Min__c xmlns=""></Req_Pay_Rate_Min__c>
				<Req_Pay_Rate_Max__c xmlns=""></Req_Pay_Rate_Max__c>
				<Req_Standard_Burden__c xmlns=""></Req_Standard_Burden__c>
				<Req_Duration__c xmlns=""></Req_Duration__c>
				<Req_Duration_Unit__c xmlns=""></Req_Duration_Unit__c>
<!-- 				<Req_Interview_Date__c xmlns=""></Req_Interview_Date__c>
 -->			</sObjects>
		</create>
	</Body>
</Envelope>